# GS_EdSh_RunDialog

## Description
Runs an edit shader dialog layout.

```pascal
PROCEDURE GS_EdSh_RunDialog(
				VAR userHitOK  : BOOLEAN;
				libraryDataPtr : LONGINT);
```

```python
def vs.GS_EdSh_RunDialog(libraryDataPtr):
    return userHitOK
```

## Parameters
|Name|Type|Description|
|---|---|---|
|userHitOK|BOOLEAN|   |
|libraryDataPtr|LONGINT|   |

## Version
Availability: from Vectorworks 2014

## Category
* Textures